app/controllers/api/v1/events_controller.rb

      def index
        events = Event.all
        if events.present?
---
SELECT "events".* FROM "events"

      def create
        @event = Event.create(event_param)
        if @event.save
---
INSERT INTO "events" ("title", "desc", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Yogyakarta"], ["desc", "about yogykarta"], ["created_at", "2019-01-09 12:24:00.036235"], ["updated_at", "2019-01-09 12:24:00.036235"], ["image", "nc0sygpkquwdddpcinew.jpg"]]
UPDATE "events" SET "updated_at" = $1, "image" = $2 WHERE "events"."id" = $3  [["updated_at", "2019-01-09 12:24:04.143927"], ["image", "image/upload/v1547036643/nc0sygpkquwdddpcinew.jpg"], ["id", 3]]

      def set_event
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]