app/controllers/api/v1/places_controller.rb

SELECT "places".* FROM "places"
---
      def index
        places = Place.all
        if places.present?

INSERT INTO "places" ("title", "desc", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Yogyakarta"], ["desc", "about yogykarta"], ["created_at", "2019-01-09 12:27:56.620631"], ["updated_at", "2019-01-09 12:27:56.620631"], ["image", "emls7jy0g9awvvvujn4x.jpg"]]
UPDATE "places" SET "updated_at" = $1, "image" = $2 WHERE "places"."id" = $3  [["updated_at", "2019-01-09 12:28:04.323102"], ["image", "image/upload/v1547036883/emls7jy0g9awvvvujn4x.jpg"], ["id", 10]]
---
      def create
        @place = Place.create(place_param)
        if @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def set_place
        @place = Place.find_by(id: params[:id])