app/controllers/api/v1/rules_controller.rb

      def index
        rules = Rule.all
        if rules.present?
---
SELECT "rules".* FROM "rules"