app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        events = Event.all
        if events.present?

INSERT INTO "events" ("title_event", "desc_event", "img_event", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title_event", "17 Agustusan"], ["desc_event", "about 17 Agustus"], ["img_event", "gambar 17 Agustus"], ["created_at", "2018-11-28 02:34:42.942977"], ["updated_at", "2018-11-28 02:34:42.942977"]]
---
    def create
        @event = Event.create(event_param)