app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
    def index
        places = Place.all
        if places.present?

INSERT INTO "places" ("title_place", "desc_place", "img_place", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title_place", "Prambanan"], ["desc_place", "about Prambananr"], ["img_place", "gambar Prambanan"], ["created_at", "2018-11-28 00:45:05.912659"], ["updated_at", "2018-11-28 00:45:05.912659"]]
---
    def create
        @place = Place.create(place_param)

UPDATE "places" SET "title_place" = $1, "desc_place" = $2, "img_place" = $3, "updated_at" = $4 WHERE "places"."id" = $5  [["title_place", "Yogyakarta"], ["desc_place", "tentang yogyakarta"], ["img_place", "gambar.jogja.jpg"], ["updated_at", "2018-11-28 06:47:11.342600"], ["id", 1]]
---
    def update
        if @place.update(place_param)

DELETE FROM "places" WHERE "places"."id" = $1  [["id", 1]]
---
    def delete
        if @place.destroy

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_place
        @place = Place.find_by(id: params[:id])