app/controllers/rules_controller.rb

    def index
        rules = Rule.all
        if rules.present?
---
SELECT "rules".* FROM "rules"

    def create
        @rule = Rule.create(rule_param)
---
INSERT INTO "rules" ("desc_rules", "img_rules", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["desc_rules", "jangan membuang sampah sembarangan"], ["img_rules", "gambar_tempat_sampah.jpg"], ["created_at", "2018-11-28 03:06:36.594528"], ["updated_at", "2018-11-28 03:06:36.594528"]]

    def set_rule
        @rule = Rule.find_by(id: params[:id])
---
SELECT  "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]